if game.GameId == 1359573625 and getgenv().creepin then
	task.wait(1.5)
	local Player = game:GetService("Players").LocalPlayer
	local TweenService = game:GetService("TweenService")
	local CollectionService = game:GetService("CollectionService")
	if not game:IsLoaded() then
		game.Loaded:Wait()
	end
	Player:WaitForChild("PlayerGui")
	repeat task.wait()
	until Player.PlayerGui:FindFirstChild("LoadingGui")
	task.wait(0.5)
	if not isfolder("CreepWoken") then
		game:GetService("StarterGui"):SetCore("SendNotification",{
			Title = "Failed to find CreepWoken files.",
			Text = "(Ensure that all files are set up accordingly.)",
			Duration = 5
		})
		return
	end

	if not isfile("CreepWoken/dontleave.mp3") then
		game:GetService("StarterGui"):SetCore("SendNotification",{
			Title = "Failed to find CreepWoken files.",
			Text = "(Ensure that all files are set up accordingly.)",
			Duration = 5
		})
		return
	end
	print("Found CreepWoken Files")
	local menuGui = Player.PlayerGui.LoadingGui
	local Overlay = menuGui:WaitForChild("Overlay")
	local loadingScript = menuGui:WaitForChild("LoadingGui")

	local function Tween(Object, TweenDirection, TweenStyle, TweenTime, Goal)
		local TInfo = TweenDirection and TweenInfo.new(TweenTime, TweenStyle, TweenDirection) or TweenInfo.new(TweenTime, TweenStyle)
		local Tween = TweenService:Create(Object, TInfo, Goal)
		Tween:Play()
		return Tween
	end

	local function typeText(chosentext,textloaded,textload,charDelay)
		local typedText = ""
		if textloaded ~= nil then
			typedText = textloaded
		end
		if charDelay == nil then
			for i = 1, #textload do
				typedText = typedText .. textload:sub(i, i)
				chosentext.Text = typedText
				charDelay = math.random(1,6)/10
				if chosentext.Text ~= textload then
					task.wait(charDelay)
				end
			end
		else
			for i = 1, #textload do
				typedText = typedText .. textload:sub(i, i)
				chosentext.Text = typedText
				task.wait(charDelay)
			end
		end
	end

	local function beginCreepWoken()
		spawn(function()
			for _, music in ipairs(loadingScript.Music:GetChildren()) do
				spawn(function()
					Tween(music,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.35, {
						PlaybackSpeed = 0.65
					})
				end)
			end
			task.wait(0.25)
			for _, child in pairs(Overlay:GetDescendants()) do
				spawn(function()
					if child.Name == "Flourish" then
						Tween(child,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
							ImageColor3 = Color3.fromRGB(255, 0, 0)
						})
					elseif child.Name == "Overlay" and child.Parent.Parent.Name == "Slots" then
						Tween(child,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
							ImageColor3 = Color3.fromRGB(255, 0, 0)
						})
					end
				end)
			end
		end)
		if loadingScript:FindFirstChild("Hover") then
			loadingScript.Hover.PlaybackSpeed = 0.6
		end
		if loadingScript:FindFirstChild("Click") then
			loadingScript.Click.PlaybackSpeed = 0.6
		end
		Tween(Overlay,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
			BackgroundColor3 = Color3.fromRGB(0, 0, 0)
		})
		Tween(Overlay.Title,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
			ImageColor3 = Color3.fromRGB(255, 255, 255)
		})
		Tween(Overlay.Vignette,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
			ImageColor3 = Color3.fromRGB(45, 45, 45)
		})
		if Overlay:FindFirstChild("Slots") then
			spawn(function()
				while true do
					if Overlay:FindFirstChild("Slots") then
						Overlay.Slots.NewSlot.Text = "e̸̢̧̢̨̧̢̱̝̪̮͖͙̯̙̩̞̘͙̳̥̟̺̭͈̼̥̞̟̜̩̺̜͙̰̜̗̗̙̯̘̰̠̦̳͈̖̠̻̝̤̞͍̮̼̲͎̺̮̪̟̜̟̻̙͕̖͔͖͍̳̬̩̒̿̄̈́̀̌͆͒͑͂̾̒̋̉̏̿̃̊̿̄͂͐́̄̽̅̉͌͛̀̈́̿̕͝͝͠Ř̶̨̧͕̻̯̙͈̹͖̲͙͔̟̥͎̻̤̮̞͓̬̦͍̙̩͖̖̳̣̹̻͖̠̭̎͊̒̏̂̄̆̚̚̚͜͝͠ͅr̶̡̢̢̧̡̨̛̛͙̜̥͚̙͔̱̭̺͈̱̥͙̩̹̭̙̜̟̭͇̼̳̥͓̤͇̰̮̥̜͈̲̮͎̥͉̯͓̫͔̪̪̖̘͔̬̲͍͇͔͌̋̑̂̒̔̈́̈̄̏̄͛̎̎͛̾͗̄̾̽̀̌͆̍̀͊̇̓̅̂̆̀͋̓͌͌̏̐̽͗̋̆̾͂͂́̾̽̃̆͂̉̽̈̊̈́͘̚͘̚͘͝͝͝͝ͅͅͅ0̴̨̡̡̡͉͙̹̰͓̦͖͍̣͚̼̘͈̼͙̳̰̙̻̦̭̹͇̙̹͍͓͈̼̲͍͖̙̬̠̲̘̤͔͈̲͍̬̠̗͔̖͉̺̞̼̜͊̃̿̇̓͌̌̊͑͊̉̋́̇͒͆͗̈͊́̔̋͗̉̿̓̆͋̆͊͊̿̈̕̕̕̕͜͜͝ͅͅͅͅͅ-̵̢̨̡̡̨̨̢̡̧̛̲̣̞̞̰͍̜͙̙̹͉͖̞͕͚̳̘͕̟̣̥͉̭̺͉̠̗̮̩̮̲͚̪̜̝͍̼͓̭̹̙̯̰̔͆͗̽̀̀͋̈́̑̅̋͛̓̔͋̈́͐̔͒͒̂̄̄̄̾̉̿̌̈́́͌͐͂̐̓̂̔̀̾̚͘͘͘̚͝͝͠ͅͅr̷̨̨̢̨̧̰̻̣̗̻̻͙̝̮̻̝̲͚͈͚͖̖̠̟̫̙͙͓͕̣̞̻͙̤̳͈̫͙̰̬͖̹̬͖̦̱̟͕̦̦̰͚͕͓̜͈̥̤̲̬̩͔̥͕͈̅́̉̓͐̿̆̏̉͊̉̄́͆̄̉̉̈́̈̾̊̍̇͘͘̕͘̚̚͝"
						Overlay.Slots.NewSlot.Shadow.Text = "e̸̢̧̢̨̧̢̱̝̪̮͖͙̯̙̩̞̘͙̳̥̟̺̭͈̼̥̞̟̜̩̺̜͙̰̜̗̗̙̯̘̰̠̦̳͈̖̠̻̝̤̞͍̮̼̲͎̺̮̪̟̜̟̻̙͕̖͔͖͍̳̬̩̒̿̄̈́̀̌͆͒͑͂̾̒̋̉̏̿̃̊̿̄͂͐́̄̽̅̉͌͛̀̈́̿̕͝͝͠Ř̶̨̧͕̻̯̙͈̹͖̲͙͔̟̥͎̻̤̮̞͓̬̦͍̙̩͖̖̳̣̹̻͖̠̭̎͊̒̏̂̄̆̚̚̚͜͝͠ͅr̶̡̢̢̧̡̨̛̛͙̜̥͚̙͔̱̭̺͈̱̥͙̩̹̭̙̜̟̭͇̼̳̥͓̤͇̰̮̥̜͈̲̮͎̥͉̯͓̫͔̪̪̖̘͔̬̲͍͇͔͌̋̑̂̒̔̈́̈̄̏̄͛̎̎͛̾͗̄̾̽̀̌͆̍̀͊̇̓̅̂̆̀͋̓͌͌̏̐̽͗̋̆̾͂͂́̾̽̃̆͂̉̽̈̊̈́͘̚͘̚͘͝͝͝͝ͅͅͅ0̴̨̡̡̡͉͙̹̰͓̦͖͍̣͚̼̘͈̼͙̳̰̙̻̦̭̹͇̙̹͍͓͈̼̲͍͖̙̬̠̲̘̤͔͈̲͍̬̠̗͔̖͉̺̞̼̜͊̃̿̇̓͌̌̊͑͊̉̋́̇͒͆͗̈͊́̔̋͗̉̿̓̆͋̆͊͊̿̈̕̕̕̕͜͜͝ͅͅͅͅͅ-̵̢̨̡̡̨̨̢̡̧̛̲̣̞̞̰͍̜͙̙̹͉͖̞͕͚̳̘͕̟̣̥͉̭̺͉̠̗̮̩̮̲͚̪̜̝͍̼͓̭̹̙̯̰̔͆͗̽̀̀͋̈́̑̅̋͛̓̔͋̈́͐̔͒͒̂̄̄̄̾̉̿̌̈́́͌͐͂̐̓̂̔̀̾̚͘͘͘̚͝͝͠ͅͅr̷̨̨̢̨̧̰̻̣̗̻̻͙̝̮̻̝̲͚͈͚͖̖̠̟̫̙͙͓͕̣̞̻͙̤̳͈̫͙̰̬͖̹̬͖̦̱̟͕̦̦̰͚͕͓̜͈̥̤̲̬̩͔̥͕͈̅́̉̓͐̿̆̏̉͊̉̄́͆̄̉̉̈́̈̾̊̍̇͘͘̕͘̚̚͝"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "ḑ̶̰͚̱͇̊̒̍̓̐͛̏̑̍̋Ę̸̢̧̢̛̛͖̞̤͚̟͉͓͔̰̭̼̖͎̟͎̲̙͇͚̭̺͓̮͖̱̳͓̮̝̰̻͇̭̖̖̣̞͓̗̥̩͖͎̘͙̱̱̦̯̫̺̟͓͎̰͖͔͍̤̤̩̌́̍̒̾̾̓̇̏̉̈́̌̆̎͊̃͑͌̀̑̀̉̍͐̃́̐̏̓͑̌̅̽̈ͅͅȃ̸̛̛̤̝̬̤͆͊͗͋͗̊̾͂̄̂̓̉̾̄͌̾̓͊̇̍͋̈͑͂͗̈̒̔̈́̾̍̐̀̒̂̈́̋̈́̀͋̔̈́̓̔̉́͐̈́́̊̑̍͐̐͆̅͋̕̕̚̕̚̕̚͠͝͝͝͠͝͝͝͠͝t̶̢̨̨̨̡̢̡̛̛̙͔̠̺̹̗̻̘̬͖͇͈̥̮͚͖̮̤̩͚͚͕̺̟̥͎̺̙̼̙̭̮̝͕͙͚̘̝͕̲͇̻͔̮̖͎͎̘̪̖̻͈̺͓̙̲͙̗̖͂̓̑͛̈́́͒͆̀̒̀͒̅̐̓̈́̐̐̈́̃̈̇͊͛̂̋̓̒̆́̆̀̈́͒̉̈̅̌̽̌͛͗̀͌́͗́̐̄͊̿͛͗̉̑́͋͆̋̍̄̂̒͋̕͘͘̕̕̕͘̕͜͜͝͠͝͝ͅͅͅh̶̡̛̛̺̗̱͈̠͕͇̝̲͚̭̩͎́̔̋͋̾̃̋̎̄̋͗̒̈̎͂̎̀̀̽̀͆̂̀̔́̌̿̈́͒̅̿̽̀̿̏͋͗̌̀̉̈́̃͒͗̓̇̔̎͐̈́̽̂̀͑̊̃̈́̓̀̾͌̏͌̌̆̐̈́͌̓̚̚̚͘̚͝͝͝͝"
						Overlay.Slots.NewSlot.Shadow.Text = "ḑ̶̰͚̱͇̊̒̍̓̐͛̏̑̍̋Ę̸̢̧̢̛̛͖̞̤͚̟͉͓͔̰̭̼̖͎̟͎̲̙͇͚̭̺͓̮͖̱̳͓̮̝̰̻͇̭̖̖̣̞͓̗̥̩͖͎̘͙̱̱̦̯̫̺̟͓͎̰͖͔͍̤̤̩̌́̍̒̾̾̓̇̏̉̈́̌̆̎͊̃͑͌̀̑̀̉̍͐̃́̐̏̓͑̌̅̽̈ͅͅȃ̸̛̛̤̝̬̤͆͊͗͋͗̊̾͂̄̂̓̉̾̄͌̾̓͊̇̍͋̈͑͂͗̈̒̔̈́̾̍̐̀̒̂̈́̋̈́̀͋̔̈́̓̔̉́͐̈́́̊̑̍͐̐͆̅͋̕̕̚̕̚̕̚͠͝͝͝͠͝͝͝͠͝t̶̢̨̨̨̡̢̡̛̛̙͔̠̺̹̗̻̘̬͖͇͈̥̮͚͖̮̤̩͚͚͕̺̟̥͎̺̙̼̙̭̮̝͕͙͚̘̝͕̲͇̻͔̮̖͎͎̘̪̖̻͈̺͓̙̲͙̗̖͂̓̑͛̈́́͒͆̀̒̀͒̅̐̓̈́̐̐̈́̃̈̇͊͛̂̋̓̒̆́̆̀̈́͒̉̈̅̌̽̌͛͗̀͌́͗́̐̄͊̿͛͗̉̑́͋͆̋̍̄̂̒͋̕͘͘̕̕̕͘̕͜͜͝͠͝͝ͅͅͅh̶̡̛̛̺̗̱͈̠͕͇̝̲͚̭̩͎́̔̋͋̾̃̋̎̄̋͗̒̈̎͂̎̀̀̽̀͆̂̀̔́̌̿̈́͒̅̿̽̀̿̏͋͗̌̀̉̈́̃͒͗̓̇̔̎͐̈́̽̂̀͑̊̃̈́̓̀̾͌̏͌̌̆̐̈́͌̓̚̚̚͘̚͝͝͝͝"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "b̵̧̧̡̧̢̥̺͓̱͇̠͚̭͙͙͎̤̭͖̱͉͚̮͈̹͚̪̯̬͓̘̙̟̩̤̲̗̈́̕͝ͅͅe̸̡̡̛̛̝̭͖͔̗͈̘̠̮̙̤̺͓̖͎͍͍̬͖̪͎̙̺̪̲͇͓͂̀̓̍̆̔̐̐̀̓̉̓̂̈͗̐̓͗̄͑̐̅͊̆̑̈́̀͆̇͂͛̉̓͌̆̊͛̚̚͜͠H̷̛̛̹̪̬̣̲̝͕̤̟̻͍̥͙̽̈́͐͌̄̐̈́̒̓͂͆̒̔͑̍̂͐̾̍͊̈̽̋̇̿̿̔̀́́̋̏̈́͗̓̑̑̅͑̔̓̓̏̀̊̂̍͊͌͐̌͑͋͆̔̉̉̊̇̎͌̈́̑̊̇̕̚͘̚̚͘̕̚͜͝͝͝͠i̶̢͍̝͕͖̲̺̝̥͈͇̝̘̜̠̲̺̱̙̟͉͂͐̄̃͌̽͋̃͌̒͌͗̑̾́͌͊̑̽̕͜n̴̢̧̨̧̧̡̹̠̼̮͓͉̤̺̥̺̙͚̲͕̦̫̺̦͖̘̻̤̬̪̺͍̗̮̣̤͕̼̮͇̥͓̤̖͖̗̙̬͎̮͍̖̞̮̣̥̻̪̩̤̲̬͇̗̦͓̣̰͚͔͉̯͐̆̅̍̉͆̓̎̌͛̃̾̐̋̍̿͂̀̊͂͆̿̆͛̋̑̆́̍͌̏̀̇̄͛̓̇̊̈́̓͗̍̋̈́̔͆̎̉̉̕̚̕͘͝͠͠ͅͅͅd̵̡̡̧̨̪̻̱̟͖͉͖̹̤̘̘͓̻̬͖̞̙͔̯̭̳͍͚̟͔̦̫͎̘̰͈̱͒̒̎̊̋͑̓̑̑̏̓̉͆́͒̉̕̕̚̕͜͜ ̸̧̛̛̛̺̮̜͓̩̒̌̋́̒͑͆̄̊̾̈̿͆̈̀̒͛̉͌̏̀́̈́͒̋̿̅̊̑̆̂̋̓̐̀͂̃̊̉̎͐̐̀̀̄̀͂́͋̓̾͛̈́̾̎́̉̿̇͂͌̊͑͛̏͆͛̐͆͗̄̎̈̃͗̄̆̚̚̚̕̕̕͝͠ÿ̷̢̨̨̡̢̡̘̤̱͚̹̻͇̠̮͇̥͔̜͖̼̳͙̰̼̠͉̫̱̠̱̹͎̤͚̬̲̖̯̤́͊̾͗̆̅͆̂̀͌̇̍̓̈͛͊̓͐͒̊̄̀͊̈́̃̔̇͒̄̂̈́̔̃̏̿̈͆͋̿̓͑͆̅͗̽͌̊̒̌̾̉͑͒̕̕̚͜ǭ̷̧̢̢̢̨̢̢̧̩̫̣̗͈̖̣͖͙̗̭͍͕̬͔̬̣͙̹̞̮̲̩͖̻̙͇̙͔͇͙̼̳̺̫̤͍͍͔͔͔̼̯̞̤͇̺͕͔̹̱̤̟̬̘͓͖͎͓͎̼̪͚̖̯̰̺̞̞̞͗̏͋͂̌̏̀͌̄́̏̐͂͋̑̈̈́̈́͂̌̑̿̊͆͗̎͂͜͜͜͝͝͠͝͠͠ͅŬ̵̡̨̧̨̨̨̥͈̼͚͉͇̘̪̖̟̗̭͇̗̩̫̝̬̪͇͈̖̩͓̦̰̩̯͖̹̥͎̗̘̳͙̺̣̱̦̙̥͚͔̘̭̹̣̟͙͎͉̩͇͇̳͍̠͚͕̥͇̺̳̣̻̻̖͎̫̺͚̺̦̰̻̤̟̓̉͜"
						Overlay.Slots.NewSlot.Shadow.Text = "b̵̧̧̡̧̢̥̺͓̱͇̠͚̭͙͙͎̤̭͖̱͉͚̮͈̹͚̪̯̬͓̘̙̟̩̤̲̗̈́̕͝ͅͅe̸̡̡̛̛̝̭͖͔̗͈̘̠̮̙̤̺͓̖͎͍͍̬͖̪͎̙̺̪̲͇͓͂̀̓̍̆̔̐̐̀̓̉̓̂̈͗̐̓͗̄͑̐̅͊̆̑̈́̀͆̇͂͛̉̓͌̆̊͛̚̚͜͠H̷̛̛̹̪̬̣̲̝͕̤̟̻͍̥͙̽̈́͐͌̄̐̈́̒̓͂͆̒̔͑̍̂͐̾̍͊̈̽̋̇̿̿̔̀́́̋̏̈́͗̓̑̑̅͑̔̓̓̏̀̊̂̍͊͌͐̌͑͋͆̔̉̉̊̇̎͌̈́̑̊̇̕̚͘̚̚͘̕̚͜͝͝͝͠i̶̢͍̝͕͖̲̺̝̥͈͇̝̘̜̠̲̺̱̙̟͉͂͐̄̃͌̽͋̃͌̒͌͗̑̾́͌͊̑̽̕͜n̴̢̧̨̧̧̡̹̠̼̮͓͉̤̺̥̺̙͚̲͕̦̫̺̦͖̘̻̤̬̪̺͍̗̮̣̤͕̼̮͇̥͓̤̖͖̗̙̬͎̮͍̖̞̮̣̥̻̪̩̤̲̬͇̗̦͓̣̰͚͔͉̯͐̆̅̍̉͆̓̎̌͛̃̾̐̋̍̿͂̀̊͂͆̿̆͛̋̑̆́̍͌̏̀̇̄͛̓̇̊̈́̓͗̍̋̈́̔͆̎̉̉̕̚̕͘͝͠͠ͅͅͅd̵̡̡̧̨̪̻̱̟͖͉͖̹̤̘̘͓̻̬͖̞̙͔̯̭̳͍͚̟͔̦̫͎̘̰͈̱͒̒̎̊̋͑̓̑̑̏̓̉͆́͒̉̕̕̚̕͜͜ ̸̧̛̛̛̺̮̜͓̩̒̌̋́̒͑͆̄̊̾̈̿͆̈̀̒͛̉͌̏̀́̈́͒̋̿̅̊̑̆̂̋̓̐̀͂̃̊̉̎͐̐̀̀̄̀͂́͋̓̾͛̈́̾̎́̉̿̇͂͌̊͑͛̏͆͛̐͆͗̄̎̈̃͗̄̆̚̚̚̕̕̕͝͠ÿ̷̢̨̨̡̢̡̘̤̱͚̹̻͇̠̮͇̥͔̜͖̼̳͙̰̼̠͉̫̱̠̱̹͎̤͚̬̲̖̯̤́͊̾͗̆̅͆̂̀͌̇̍̓̈͛͊̓͐͒̊̄̀͊̈́̃̔̇͒̄̂̈́̔̃̏̿̈͆͋̿̓͑͆̅͗̽͌̊̒̌̾̉͑͒̕̕̚͜ǭ̷̧̢̢̢̨̢̢̧̩̫̣̗͈̖̣͖͙̗̭͍͕̬͔̬̣͙̹̞̮̲̩͖̻̙͇̙͔͇͙̼̳̺̫̤͍͍͔͔͔̼̯̞̤͇̺͕͔̹̱̤̟̬̘͓͖͎͓͎̼̪͚̖̯̰̺̞̞̞͗̏͋͂̌̏̀͌̄́̏̐͂͋̑̈̈́̈́͂̌̑̿̊͆͗̎͂͜͜͜͝͝͠͝͠͠ͅŬ̵̡̨̧̨̨̨̥͈̼͚͉͇̘̪̖̟̗̭͇̗̩̫̝̬̪͇͈̖̩͓̦̰̩̯͖̹̥͎̗̘̳͙̺̣̱̦̙̥͚͔̘̭̹̣̟͙͎͉̩͇͇̳͍̠͚͕̥͇̺̳̣̻̻̖͎̫̺͚̺̦̰̻̤̟̓̉͜"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "ç̷̢̧̢̢̛̪͙͉̩̭̫̼̳̭̫̤̦̰̜̲̣̪̦̲̠̲̝̥̪̭̙̩̙̜̞̙̼̰̟͉̱̟̟͓̤͍̤̖̜̝̰͓̣̤̲̖͖̹͓͖̯͇͈̞͆͌͂̈́̊̑̍̅͋͛̃̓̓̃͋͆́̒̄̈͒̈́̈́́̈́͂͑̍͑̍͌͐́̅̎̾̈́̉͐̔̓̊͊͂͊̒̊͋́͒̃̾͆̈́̓͂͛͗̊̆̿͋̎̄͊̓̎̎͋͛̆̚̚̕̕͘̕̕̚͜͠͝͝͠͝͠͝ͅͅR̷̢̡̢̡̡̡̨̛̛̛̤͉͉͉̪̻͚̤̣̳̬̹̘̥̜̘̭͖͙̠̪̰̱͎͉͖͉͎̠̤̠͚̲̟̜͚͚͇͈̫̗̥̥͎̤͍̩̙͉̗͈͔̜͌͑̉̊͋́̓͛̀̆̀̀̔͒͋̉̈́̈́͗͑̒̉̾͆͂̔̌̽̀̑͋̈̌͛͋̑͆̈́̑̊̽͌͆̆̂̿̈́̃͛̅̈́̈́͆̊̔̑̃̀̍͊͒̽̑̇̔̔̇̍͊̈́́͛̿̀̈͊̈͘̚̚͜͝͝͝͝͝͠ͅe̸̢̡̢̢̛̛͔̺͉̰̬̗̪̟̬̩̙͈̪̖͉͚̖̭͓̙̪̹̮͂́̏͆͛̈̉́͛̐̉̋̈́͌͗̎̄̄͛͌͒́̊̓͊̐̊͋̂̄̓̅́̉̾̀̇͐͛͗̽͋͑̚̕̚͝͝͠ͅͅȩ̶̢̢̧̡̡̢̢̧̛̭̜̱̣̖͍̦͚̞͔̣̺̻̞͉̙̟̦͙̰̗̻̝̰̭̩̭͕̖͔̞̙͉̝̦̲̩̗͈̼̰̮̖̫̠̪̖̜͓̭̣̰̞͇̯̘̪̦̬͇͕͓̗͖̲͍͇̝̒̀͊̈͛͋͒̋͋̾̂͂̇́̎̍͊̿̃͋̍̓̔̋͑̃̇̑̒͌̄̈̈́̓͒̊̑̈́͘͘͜͜͝͠͠͝ͅP̴̡̧̡̢̡̢̨̡͚̘̱̯̞̬̹̭̗̳͔͍͉̩̮͇͖̙͓̘͚̟̜̲͉̬̣̣̼̮̻̗̯͍̪̭͔̭̹̳͕͍͈̠͚̰̣̼̲͍̩͕͓̲͎̤̹̼̦͖̲͇̯̳̥̂̽̍̍̊̽͋̀̽̿̒͒̋́͜͝ͅW̵̡̢̛̛̺̖̺̤͔͎͇͚̰̟̫̠̙̬͇̳̲̜͓̰̥̫͚̋̈́̽͊̐̎̉̆̏̃̑͂̉̈́͗̂̋̂̋̊͗͋̋̀͊͌́́̀̿̐̾̏̔̀͗͑̍́̊̎̽̏͒̄̂̒̾͗̋̈́̽͒̈́̿̿̕̚̚͜͝͝͝ͅͅơ̷̡̨̢̧̨̨̡̧̡̨̧̨̛͖̞̳̺̪̠̣̦͚͙̺̱̠̣̲̝̞̫͚̦̖͇̼̫̠͇̝̮͇̳̬͕̮̲̥͈̞͎̲̻͉̖͕̻̭̥̗͓̬̦̫̝̪͚͔̘̞͔͖̥͍̣̼̮͑̉̂̓́͗̀̊͑̿͂̒̃́̊̾̎͆̑̋͑͗̓̓͊̏̑̈́̈̒̎̆͐̅̽̏̎̄̍̃̊̑̍̍͛̓̒̀̅̀̈͗̏̓͂͋̎̃̾̌̄̕͘̕̚̚̕͜͜͝͝͝͝ͅͅk̴̢̢̡͈͉͚̯̬̪̟̼͎̯̻͍͕̭͖̖̪̙̓͂͛̀̐̔̓͜͜͝͠ĕ̴̡̧̡̙̠̬̹̜̺̬͉̗̟͓̦̱̠̞̬͎̮̗̼̪̹̜͇̺̠̬̳̲͛́̃͑̆͊̆͆͗͗̈́́̄͛̊͒̏͑̐̑͗̎̔̂̅̾̄͆̈́́̓̊̃̅̏̈́̎͆͐͋̽̾̓̐̓͛͋͊͌͌̌͒̑́͒͌͋̔̅̓̓̊͒̇́͒̌̇̈́̋̚̕͘̕͘͘͜͝͠͠͠͝͠͠͝͝͝ͅn̴̡̢̢̢͔̬̼̬̱̙̰̫͍͖̪̮͉̟͍͔̘͙̞̪͕̱͇̞̩̈̒͗͌͛̅́́̏́̓̀͂̐̈́̔̊͑͑̎̂͛̒͌̎̈́̓̆̊̌̅̒̐̂̔̓̎͆̎̂̂͌̈̌̀̽̑̚͘̕͝͝͝͠ͅ"
						Overlay.Slots.NewSlot.Shadow.Text = "ç̷̢̧̢̢̛̪͙͉̩̭̫̼̳̭̫̤̦̰̜̲̣̪̦̲̠̲̝̥̪̭̙̩̙̜̞̙̼̰̟͉̱̟̟͓̤͍̤̖̜̝̰͓̣̤̲̖͖̹͓͖̯͇͈̞͆͌͂̈́̊̑̍̅͋͛̃̓̓̃͋͆́̒̄̈͒̈́̈́́̈́͂͑̍͑̍͌͐́̅̎̾̈́̉͐̔̓̊͊͂͊̒̊͋́͒̃̾͆̈́̓͂͛͗̊̆̿͋̎̄͊̓̎̎͋͛̆̚̚̕̕͘̕̕̚͜͠͝͝͠͝͠͝ͅͅR̷̢̡̢̡̡̡̨̛̛̛̤͉͉͉̪̻͚̤̣̳̬̹̘̥̜̘̭͖͙̠̪̰̱͎͉͖͉͎̠̤̠͚̲̟̜͚͚͇͈̫̗̥̥͎̤͍̩̙͉̗͈͔̜͌͑̉̊͋́̓͛̀̆̀̀̔͒͋̉̈́̈́͗͑̒̉̾͆͂̔̌̽̀̑͋̈̌͛͋̑͆̈́̑̊̽͌͆̆̂̿̈́̃͛̅̈́̈́͆̊̔̑̃̀̍͊͒̽̑̇̔̔̇̍͊̈́́͛̿̀̈͊̈͘̚̚͜͝͝͝͝͝͠ͅe̸̢̡̢̢̛̛͔̺͉̰̬̗̪̟̬̩̙͈̪̖͉͚̖̭͓̙̪̹̮͂́̏͆͛̈̉́͛̐̉̋̈́͌͗̎̄̄͛͌͒́̊̓͊̐̊͋̂̄̓̅́̉̾̀̇͐͛͗̽͋͑̚̕̚͝͝͠ͅͅȩ̶̢̢̧̡̡̢̢̧̛̭̜̱̣̖͍̦͚̞͔̣̺̻̞͉̙̟̦͙̰̗̻̝̰̭̩̭͕̖͔̞̙͉̝̦̲̩̗͈̼̰̮̖̫̠̪̖̜͓̭̣̰̞͇̯̘̪̦̬͇͕͓̗͖̲͍͇̝̒̀͊̈͛͋͒̋͋̾̂͂̇́̎̍͊̿̃͋̍̓̔̋͑̃̇̑̒͌̄̈̈́̓͒̊̑̈́͘͘͜͜͝͠͠͝ͅP̴̡̧̡̢̡̢̨̡͚̘̱̯̞̬̹̭̗̳͔͍͉̩̮͇͖̙͓̘͚̟̜̲͉̬̣̣̼̮̻̗̯͍̪̭͔̭̹̳͕͍͈̠͚̰̣̼̲͍̩͕͓̲͎̤̹̼̦͖̲͇̯̳̥̂̽̍̍̊̽͋̀̽̿̒͒̋́͜͝ͅW̵̡̢̛̛̺̖̺̤͔͎͇͚̰̟̫̠̙̬͇̳̲̜͓̰̥̫͚̋̈́̽͊̐̎̉̆̏̃̑͂̉̈́͗̂̋̂̋̊͗͋̋̀͊͌́́̀̿̐̾̏̔̀͗͑̍́̊̎̽̏͒̄̂̒̾͗̋̈́̽͒̈́̿̿̕̚̚͜͝͝͝ͅͅơ̷̡̨̢̧̨̨̡̧̡̨̧̨̛͖̞̳̺̪̠̣̦͚͙̺̱̠̣̲̝̞̫͚̦̖͇̼̫̠͇̝̮͇̳̬͕̮̲̥͈̞͎̲̻͉̖͕̻̭̥̗͓̬̦̫̝̪͚͔̘̞͔͖̥͍̣̼̮͑̉̂̓́͗̀̊͑̿͂̒̃́̊̾̎͆̑̋͑͗̓̓͊̏̑̈́̈̒̎̆͐̅̽̏̎̄̍̃̊̑̍̍͛̓̒̀̅̀̈͗̏̓͂͋̎̃̾̌̄̕͘̕̚̚̕͜͜͝͝͝͝ͅͅk̴̢̢̡͈͉͚̯̬̪̟̼͎̯̻͍͕̭͖̖̪̙̓͂͛̀̐̔̓͜͜͝͠ĕ̴̡̧̡̙̠̬̹̜̺̬͉̗̟͓̦̱̠̞̬͎̮̗̼̪̹̜͇̺̠̬̳̲͛́̃͑̆͊̆͆͗͗̈́́̄͛̊͒̏͑̐̑͗̎̔̂̅̾̄͆̈́́̓̊̃̅̏̈́̎͆͐͋̽̾̓̐̓͛͋͊͌͌̌͒̑́͒͌͋̔̅̓̓̊͒̇́͒̌̇̈́̋̚̕͘̕͘͘͜͝͠͠͠͝͠͠͝͝͝ͅn̴̡̢̢̢͔̬̼̬̱̙̰̫͍͖̪̮͉̟͍͔̘͙̞̪͕̱͇̞̩̈̒͗͌͛̅́́̏́̓̀͂̐̈́̔̊͑͑̎̂͛̒͌̎̈́̓̆̊̌̅̒̐̂̔̓̎͆̎̂̂͌̈̌̀̽̑̚͘̕͝͝͝͠ͅ"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "d̸̡̢̛̛̛̛̞̺̖̭͚͇̋́͑̃͒͆̂̀́̀̄̿́́̋̈́̍̄̉̋̇̂͗̀͋̇͆̋̇͛̂͋͋̑̓̐̾̓̉͒̓͊͗̀͑͆̒͋͂̋̂̋̈́̽͂͗̉̑̈̈́̌̃̓̅͌́̒̅͆̒͐͊̊̈́͐̇̓̌͊͘̕̕̚̕̕̕͝͠͝͝͠͝͠͝͝͝ơ̶̧̧̧̡̨̨̨̡̨̫̥͚͉̖̬̺͔̭̮͔̻̟͉̤̹̝̼̩̮̻͇͙͔̬̦̻̫̺͖͔̘̙͕̤̩͕̬̜̥͕̤̟̹̘̯̲͎̰͈̫̺̩͍̰̜͕͔̦̞̯̜̪̩͚̺̩͉͎͔͔̙͈̰̬̲̩̖̙̝̮̠̒̆͌̉͐̏̊̐̏̀̉̊̋̎̈́͗̓̄̍̇͋̇͌̓̀͊́̀̈́̂͂͂͋̄͘̕͘͜͜͜͝͠ͅN̵̨̧̨̛̛͍͕̲̣̲͈̰͉̞͕̦̼̬̗͖͍̩͈̗̰͓̜̠̘͇͚̜̜̙̯̥̣̺̲̖̞̮̠̫̫̤̮̖͔̭̖̯͉̗̗̠͍̤̰͖͎̹̭̗̪̮͖͚̦̞̜͚̤̉̓̋̇̆̿̅̉̈́͛̓͒͂̒̏̈́̒̀̈́̊̏̅̆̑̉̈́̇̌͂̍̂̀͑́͊̓̓̂͑̀̋̋͐̾͌̅̔͐͐̅͒̀̂͐̆̈́̈́͛̑̄̑͊͐̑͋̈́̌̈̇̕̚͜͜͝͝͠͠͝͝ͅͅṯ̵̢̛̛̝̖̬̥̙̬͓̠̦̱͙̋̀̋̆͋̓̓̋̏̍̈́̂̈́́̽͗̀̉̈̀͒̎̓͗̔͒̋͐̃̀̊͂̆̌̂́͑̇̔̀̋̉̊̉̌́́̐̾͂̌̀́̎̆͑̀͒̀̓̅̿̈̆̑͒͆̀̎͂̌̄͆͌̄̏̄̌̀̆̊͊̂̾͘͘̚͘͘͝͝͝͝͝͠͠͠ ̴̡̢̛̛̛̹͈͈̬̲͈̇̇͑̈̅̃͂̌͐͗̈́̓̋͋̒̽̿̆̿͑̅̑̒̽̈́͛̀̀͌̇̊́̂̽̉̎̽̒͒̀̀̂͒͛͆̊̇̌͐̑́̾̄͑͋̑́̐͂̚̚̚̚͘͠͝͝͝͝͠͝ͅͅl̷̢̡̢̢̛͇̞̤͕̣̠̠̩̬̺̝̣̬̗̦̦̣̭̜̤̤̦̱̇͂͊̀̀̓̈́̆͛̿̈́͂̆̂̍͒̅̂̂͗̍̓̀͐͌̑̂͑͑̂́̈̈̀̊̓͛̔͋̏̆̃̈́̂͋̓̀͋͑̐̅̓̚͘͝͝͠Ę̷̨̢͉̫̲͓̞̫̥̼̯͖͚͇̤͚̥͙̬͉̖̩̼̔̌̒̌͗̋̋̚͠͠á̶̢̧̢̛̛̛̛͉̱̱̘̦̟̮̬͚͔̝̯̲̦͎̙̱̂̓̒̑͆̃͒̒̈́̅̃̆́́͊̓̇̄̒̽͆̓͗̎̐͌̍̽́͂͒̿̏́͊̀̓̈̓̍̃̊̈́̂̔̽̃́̑̆͋̈̽̌̀͑̂̍̓̑̽͑͘͘̚̚͘͜͝͝͝͝͝͝͝V̵̢̧̧̝̪͙͎͚̪̘̱̟̞͖͎̬̰̳͉͚̝̝̯̱̑͜ę̴̧̨̢̢̡̡̛̛̛̩͙̙͙̝͎̤͖͇̗̖̭̻̥̙̹͕͙̫͚̹͈͍̤̘̺̰͔̖̘̥̞̻͕̩͍̺̲͇̰̙̫̦͇̪̻̤̖̘̝̩͍͕̮̞͙̳̼̣̼͈̼̹͔͖͙͍̰̃́̆̋̿̀̈́̐̿͐͒͋̅̿̀̈́̀͛̉̉͋̿͊̌̾̃͗̿̈́̌́̈́̅̒͗́́̇̓́̈́͆̅͌̈́̂͂̾̓̐͐́̀̄̚̕͘̕͘͠͝͠ͅͅ"
						Overlay.Slots.NewSlot.Shadow.Text = "d̸̡̢̛̛̛̛̞̺̖̭͚͇̋́͑̃͒͆̂̀́̀̄̿́́̋̈́̍̄̉̋̇̂͗̀͋̇͆̋̇͛̂͋͋̑̓̐̾̓̉͒̓͊͗̀͑͆̒͋͂̋̂̋̈́̽͂͗̉̑̈̈́̌̃̓̅͌́̒̅͆̒͐͊̊̈́͐̇̓̌͊͘̕̕̚̕̕̕͝͠͝͝͠͝͠͝͝͝ơ̶̧̧̧̡̨̨̨̡̨̫̥͚͉̖̬̺͔̭̮͔̻̟͉̤̹̝̼̩̮̻͇͙͔̬̦̻̫̺͖͔̘̙͕̤̩͕̬̜̥͕̤̟̹̘̯̲͎̰͈̫̺̩͍̰̜͕͔̦̞̯̜̪̩͚̺̩͉͎͔͔̙͈̰̬̲̩̖̙̝̮̠̒̆͌̉͐̏̊̐̏̀̉̊̋̎̈́͗̓̄̍̇͋̇͌̓̀͊́̀̈́̂͂͂͋̄͘̕͘͜͜͜͝͠ͅN̵̨̧̨̛̛͍͕̲̣̲͈̰͉̞͕̦̼̬̗͖͍̩͈̗̰͓̜̠̘͇͚̜̜̙̯̥̣̺̲̖̞̮̠̫̫̤̮̖͔̭̖̯͉̗̗̠͍̤̰͖͎̹̭̗̪̮͖͚̦̞̜͚̤̉̓̋̇̆̿̅̉̈́͛̓͒͂̒̏̈́̒̀̈́̊̏̅̆̑̉̈́̇̌͂̍̂̀͑́͊̓̓̂͑̀̋̋͐̾͌̅̔͐͐̅͒̀̂͐̆̈́̈́͛̑̄̑͊͐̑͋̈́̌̈̇̕̚͜͜͝͝͠͠͝͝ͅͅṯ̵̢̛̛̝̖̬̥̙̬͓̠̦̱͙̋̀̋̆͋̓̓̋̏̍̈́̂̈́́̽͗̀̉̈̀͒̎̓͗̔͒̋͐̃̀̊͂̆̌̂́͑̇̔̀̋̉̊̉̌́́̐̾͂̌̀́̎̆͑̀͒̀̓̅̿̈̆̑͒͆̀̎͂̌̄͆͌̄̏̄̌̀̆̊͊̂̾͘͘̚͘͘͝͝͝͝͝͠͠͠ ̴̡̢̛̛̛̹͈͈̬̲͈̇̇͑̈̅̃͂̌͐͗̈́̓̋͋̒̽̿̆̿͑̅̑̒̽̈́͛̀̀͌̇̊́̂̽̉̎̽̒͒̀̀̂͒͛͆̊̇̌͐̑́̾̄͑͋̑́̐͂̚̚̚̚͘͠͝͝͝͝͠͝ͅͅl̷̢̡̢̢̛͇̞̤͕̣̠̠̩̬̺̝̣̬̗̦̦̣̭̜̤̤̦̱̇͂͊̀̀̓̈́̆͛̿̈́͂̆̂̍͒̅̂̂͗̍̓̀͐͌̑̂͑͑̂́̈̈̀̊̓͛̔͋̏̆̃̈́̂͋̓̀͋͑̐̅̓̚͘͝͝͠Ę̷̨̢͉̫̲͓̞̫̥̼̯͖͚͇̤͚̥͙̬͉̖̩̼̔̌̒̌͗̋̋̚͠͠á̶̢̧̢̛̛̛̛͉̱̱̘̦̟̮̬͚͔̝̯̲̦͎̙̱̂̓̒̑͆̃͒̒̈́̅̃̆́́͊̓̇̄̒̽͆̓͗̎̐͌̍̽́͂͒̿̏́͊̀̓̈̓̍̃̊̈́̂̔̽̃́̑̆͋̈̽̌̀͑̂̍̓̑̽͑͘͘̚̚͘͜͝͝͝͝͝͝͝V̵̢̧̧̝̪͙͎͚̪̘̱̟̞͖͎̬̰̳͉͚̝̝̯̱̑͜ę̴̧̨̢̢̡̡̛̛̛̩͙̙͙̝͎̤͖͇̗̖̭̻̥̙̹͕͙̫͚̹͈͍̤̘̺̰͔̖̘̥̞̻͕̩͍̺̲͇̰̙̫̦͇̪̻̤̖̘̝̩͍͕̮̞͙̳̼̣̼͈̼̹͔͖͙͍̰̃́̆̋̿̀̈́̐̿͐͒͋̅̿̀̈́̀͛̉̉͋̿͊̌̾̃͗̿̈́̌́̈́̅̒͗́́̇̓́̈́͆̅͌̈́̂͂̾̓̐͐́̀̄̚̕͘̕͘͠͝͠ͅͅ"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "Ŗ̵̢̨̡̨̢̨̢̢̧̛̛̻͇͚͍̪͎̫͚̹̞̯͎̜̣͇̹͖̰̜͙̗̲̱̜͖͕̥̗̖̩̬͔̞̰̭̖͔̠͎͎̤͎͇̘͓̦̞̥̦̙̪̩̮̩̘̬͚̲̮͉̬͎̞̬̼̦̎̊͗̋͋̎̒̇͑̏̈́̋̇͆̓̅̇͗͒̐̄̍̽͛͒̇͑̓̒̇͋͊̀̓̃̇̌̓̏̋̂̿̑͐̿̄̓̒̓̏͑̎̾́̒̆̓̀͛̈́͗̄̄̌̈̿̈̾̀͑͑́̓̆̓͑̈́̒̍͊̑̎̀̓̆̋̇͘͘͜͜͝͝͝͝͠ͅͅͅỪ̵̡̡̢̡̧̱̖̗̩͕̜̜̦͎̖̝̜̝̳̺͉̮͚͙͚̝͍͎͍̥̭̹̞̝͈̭̼͙̰̝͉̤̥͓̘̱̟̜̬̝̦̭̜̹̽̔̄̇͂̈́͌̓̇̀̊̎̓̑͒̔͊̊̐̎̅̓̓̈́̊͋̌̍͌̏́̅͊͑͊͗̈͑̑̔̊͂̃͆̏͌̄͆̿̂́̔̀̒̽̿͋̂̈́̀̓͌̀̇͋̈́̊̑̏̒͆͆̈́̔͌͂́̿̄̔̕͘̕̚̕̕͘͝͝͝͠͝͠N̸̢̨̡̧̢̛̛̛̛̼̟͇͕̻͍͚̼̟̠̖̪̜͕̙̜̭̞̹̤̗͚̗̥͈͔̙̝͖̮͉̺͖͕͔̤̼͙̦̯̖̜̗̱̉̇̅̿̈͆͌̎͐̈̎̒̒́̾̉̒̑̂̊̆̃̉̿͛͐̈́͒͆̉̄͆̒͒̓̓͒̍͐́͂̆̽̉͛̄̎̑̎̓̐̊̔̀̇̀͒̓͊̄͛̿̒͋̅̋̈̌̆̔̂̓̽͐̄͊͛̀̀̈́̈̓͋̆́̈́̽̚̚͘̕̚͘̕̚̕̚̕̕͝͝͝͠͝͝ͅ ̴̡̨̨̨̧̡̘̲̺̫̳̝̖̖̣̼͈̝̬̱̼̮̝̻͕̗̹̖̳̰̞̙͕̟̜̟̠͉̘̜̳͕̰͇̹̟̰̫̮̖͔͇͖̤̲͇̳̙̦̹̞̞̞̠̙̭̯̥͇͓͖̠͈̌͆͛̎͂̓̈́̓̊͛̄͆͌̓̐̉̀͆͜͜͜͜͜͠ͅR̵̨͉͍͔̙͆̓͋͂̈͆̿̋͋͠ͅƯ̷̛̭̦̰͚̩̯͓͒̈́͗̉͋̀̾̓̽͒̽̈́͗͂́͌̌͗̆̇͆̓̋̓̎̊̈́͊̽̌͗̐̈́̊͛̽̋̋̑͑̊͆͆͛͒̍̒̅͂̇̑̅̓͑̾̎̑̊͋͗̌̓̎̑͗̀̉͒̉̏͐̈́͊̇̓̿͌̓̍̉̅̐͐̎̚̕͘̕͘͘̚̕̚̚͝͠͝͠͝͝͝͝͠͠͝Ņ̸̡̨̨̡̛̛͙̫̟̰̦̥̪͓͔̯͔̟͖̺̖͙̝̹̼̺͈̼̬͚̗͔̩̙̯̮̜̝̣͕̲̤͍̦̙̱̗̯̦̥̼̖͎̹͇̣̣̤͍̺̳͈̠͓̗̻̘̟̱̹͈̘͉̣͕̻͔̼̟̯͙͓͈̳̝̝́̀͗̀̀̽̏̈́̓̑̾͂͋͂̀̊͐͊̑̌͑͑͑̌̏̓̿̅̏̎̏͌̎̍͌̓̔̾͌͊̓̿̉̅̅͆͆̓̇́̾̇͐̀̀͋̚̕͘̕̕̕͘͘͜͠͠ͅͅ ̵̨̤͎͔͉͔̱̌̊̈̂̒̾̕͘R̴̙̻̆̓̏͑̄̾̽͊̉̿̈́͑̀̈́̋̓͌̎̒̈́͝͠Ú̸̡̨̡̡̧̨̢̧̪̰͓͈͔̬̟̻͖͚͔̺̞̦̭̘̮͇͎͓͍͖̪̼̠̮͈̹̗͕͈̘̥͚͈̘͚̦͙͚̰̣̜̮͇̮̞͈͓̹̤͔̙̩̞̦̪̠̩̥̩̱̺͉̳̬̰̘͓̿͐̂̇̉̚͜͜ͅͅṄ̸̨̛̫̣̟͓͇͕̹̦̝̘͉͉̘͖̺͉̜̹͎̦̰͔̪̯̰̗̪̬̣̠̞̰͈̭͚̘̮̗̪̝̣̪͇̥̥͓̘̣͉̘̻̃͊͊̽̌̄̏̄͂͆̃̊̂̾̈́̍̾̽̄̒̀̓̂̀̑̐͐̓̅̇̀͆̅̈́̆͘͘͜͜͜͜͝͝͝ ̸̢̡̡̢̡̧̧̨̧͙̯͎͔̬̬͙̮̣͔̩̥̻̣̰̰̖̜̤̱̝͇̘͎͓͉̮̯̱̜̫̯͇̮̣̯͚̳̜͈͚͖͎̫̟͈͕̹̣̹̰̹̬̘͉̞̩͔̫̘̟̟̹̺̘͈̪̱̣͙͍͈̙͛̐̈̃̄̿͋̈́͗̓̀͗̆̈́̈́̏͆̓̈́͌͗̄̉́̎͐̏͒̓͂͂͑͌͘̚̚̕̚͜͜͝͠Ŗ̷̡̨̛̛̛̼̰̻͙̹͇̬̻̫̭̎̀͂͆̉͂͒̿̏̆͊͊̈́͐̒́̽̅͆̎́́̾̏̀́͋̔̄̔͊͒̏́̌̊́̎̈́̚̚̕͝͝͠Ư̶̢̧̡̨̨̡̨̡̢̧̧̡̬̥̻̺͓̦͍̝̩̻̰͓̰̺̘̰̤̝̲͚̠͉̯̰̫̘̜̼͔̜̦̞̼̖͙̣͎̖̤̺͚̥͙̫͔̞͎͔̻̞̻͇͓͙͔̹͖͈̪͚̬̰̻͍̯̝̖̠͉̬͙̥̼̜͉̦̦̫̦͙̞͔̙̝̝̪͇̟̏̈́̄̈͑͛̀̈̍̃̆͂̈́̾̈́͂̑̑̏͐̊̊̃̿́͌͑͂̐͆̒̋͋̊̓̀͆̆͐͗̎͗̓̏͑͐̈́̂͋̍̌͌͘͘̕͜͠͠͠͠ͅͅͅͅN̵̢̨̧̨̨̛͔̹͓͈̞̙͚͔̖̩̦͇̦̥͎̳̯̯̘͇̥̺̗̱̞̼̞̙̖̘͇̜̗͇̥͓̹͎̻̣̦͈͈̫͕͇̤̭̍̑̒̓͆̇̔̓̀̿̊̍̓͋̏͒̊̒̓̐̓́̆̉̂̓́̈̋́͑̍̓͆̿͊̏͆̎͊̇̓͛̒̇̈͋͐̀̒͗̑̽͐͋͒̓̚͘͘̚̚͘͘͘͘̕͜͜͠͝͠͝͝ͅ ̵̨̧̢̢̢̛̰͉͎͕̳̦̥͚͎̥͔̠̯̹̭͔͇̱͕̬̹̺̰̞͖̯̺̳̤̝̮̺̮̟̭̝̥͕͖̮̯̰̣̫͕͈̮̆̏̂̈́̐̊̃̐̽̓̐͆̒́̑̈̆̿̓̽̿̄͐̑̉̓͊̅̀̈́̔͗͊̉̽͗̇̈̈́̃͗̃̔͛̓̀͒̉͋̃̾̈́̓̇̚͘̚̚̕͝͠͠͝͝͝͝͠͠ͅR̵̛̪̞̥͒Ứ̴̢̧̧̛̛͕̩̟̭͉̟̭̦̮͇̠̬̳̦̤͚͓̪̪͉̱͖͎̠̭͚͓̜͙̣̦͙̠͍̭͍͈̟͖̥͍̈́̂̑̈́̌̏́͐̇͗̇͗̓̿̀̌̓̌̈́̈́̑̇̍̾͐̒̃͑̓̈̑̈́̋̈́͑̃͗̅̏̽̾́̔͒̀̓̊̀̒́̎̍̇͛͑̆̕̚͜͠͝͠͝͝ͅŅ̴̡̨̨̢̣̪̲͎̺̟̹̤͓̠̦̗̦̙͔̲̮̤̜̙̙̼̭͎̦̫̞̬͓̱͎̳̘͖̬̳͙̬̫̠̝̙͖̝̙͍̱̭̯̞͒͛̂̅͆͌̂̇̒̂̇͌̓͌̃͂͒̀̏̉̈̒̕ͅͅ ̸̛̰̟̖̗̼͓̲̹̩̓͛̋̂̇̓̄̀̒̌͛̂̇̂͊̉͐̍͊̈́̏͋̀̏̿̇̔͆̓̍̅́̊̄̒͒͑̌͗͑̐̚̕͘͜͠͠͝Ŗ̴̢̡̛̛͉̳̪͍͙̣͕͍̙̩̝̝̘͔̲̟̭̖̠̝͇͚̫͓͔͎̣̗̦̤̮̟̬̮̣̞̱͓͆̋̉̿̓̊̿̈̽́͆̉̇̑̇̃̃̄̎͑̂͗̈͊̋̏̓͛͒̍̽̇̓̑̓̎̿̓̎͐̓̂̐̉̃̄̓͋̈̀̚̕͜͝͝͠͝ͅͅƯ̸̧̞̣̝͇̬͓͔̻͇̱̰̼̙̫̩̳̓̆̈́̀͊̽́̓̊̒̆̋͐͊̾͐̀́̂́̅͆́̅͛̇͗̓͒̓̂̅͐͂͐̈́̆̈́̉̊̍̆͆̑̋͌͆͊̑̅̑͊͗͛̅̋͌́̏̋̽͑̄̎̀̈́̉̎͛̽͑̆͋̈́̿̐̀͗̅͐͋͗̕̚͘͘͘͘̚̚͜͝͝͝͠͝͝N̷̢̧̛̛̛̻̩̦͕̜͔̙̼̪̪͈̦̥͇̹̬̻̠̱̆̽͊͗̓̈̈́̓̇̅̂̀̌̅̆̄́̽̏̍͆̈́̅̈́̓͒̾̂̐͑̉͛̒̋͂̅͒̑̋̉͆̏̀̿̿̊̒̐́̑̍̊͂̽͒̉̈́̏̓̅̿̓̋͌́͂̕͘̕̚͠͠͠ͅ"
						Overlay.Slots.NewSlot.Shadow.Text = "Ŗ̵̢̨̡̨̢̨̢̢̧̛̛̻͇͚͍̪͎̫͚̹̞̯͎̜̣͇̹͖̰̜͙̗̲̱̜͖͕̥̗̖̩̬͔̞̰̭̖͔̠͎͎̤͎͇̘͓̦̞̥̦̙̪̩̮̩̘̬͚̲̮͉̬͎̞̬̼̦̎̊͗̋͋̎̒̇͑̏̈́̋̇͆̓̅̇͗͒̐̄̍̽͛͒̇͑̓̒̇͋͊̀̓̃̇̌̓̏̋̂̿̑͐̿̄̓̒̓̏͑̎̾́̒̆̓̀͛̈́͗̄̄̌̈̿̈̾̀͑͑́̓̆̓͑̈́̒̍͊̑̎̀̓̆̋̇͘͘͜͜͝͝͝͝͠ͅͅͅỪ̵̡̡̢̡̧̱̖̗̩͕̜̜̦͎̖̝̜̝̳̺͉̮͚͙͚̝͍͎͍̥̭̹̞̝͈̭̼͙̰̝͉̤̥͓̘̱̟̜̬̝̦̭̜̹̽̔̄̇͂̈́͌̓̇̀̊̎̓̑͒̔͊̊̐̎̅̓̓̈́̊͋̌̍͌̏́̅͊͑͊͗̈͑̑̔̊͂̃͆̏͌̄͆̿̂́̔̀̒̽̿͋̂̈́̀̓͌̀̇͋̈́̊̑̏̒͆͆̈́̔͌͂́̿̄̔̕͘̕̚̕̕͘͝͝͝͠͝͠N̸̢̨̡̧̢̛̛̛̛̼̟͇͕̻͍͚̼̟̠̖̪̜͕̙̜̭̞̹̤̗͚̗̥͈͔̙̝͖̮͉̺͖͕͔̤̼͙̦̯̖̜̗̱̉̇̅̿̈͆͌̎͐̈̎̒̒́̾̉̒̑̂̊̆̃̉̿͛͐̈́͒͆̉̄͆̒͒̓̓͒̍͐́͂̆̽̉͛̄̎̑̎̓̐̊̔̀̇̀͒̓͊̄͛̿̒͋̅̋̈̌̆̔̂̓̽͐̄͊͛̀̀̈́̈̓͋̆́̈́̽̚̚͘̕̚͘̕̚̕̚̕̕͝͝͝͠͝͝ͅ ̴̡̨̨̨̧̡̘̲̺̫̳̝̖̖̣̼͈̝̬̱̼̮̝̻͕̗̹̖̳̰̞̙͕̟̜̟̠͉̘̜̳͕̰͇̹̟̰̫̮̖͔͇͖̤̲͇̳̙̦̹̞̞̞̠̙̭̯̥͇͓͖̠͈̌͆͛̎͂̓̈́̓̊͛̄͆͌̓̐̉̀͆͜͜͜͜͜͠ͅR̵̨͉͍͔̙͆̓͋͂̈͆̿̋͋͠ͅƯ̷̛̭̦̰͚̩̯͓͒̈́͗̉͋̀̾̓̽͒̽̈́͗͂́͌̌͗̆̇͆̓̋̓̎̊̈́͊̽̌͗̐̈́̊͛̽̋̋̑͑̊͆͆͛͒̍̒̅͂̇̑̅̓͑̾̎̑̊͋͗̌̓̎̑͗̀̉͒̉̏͐̈́͊̇̓̿͌̓̍̉̅̐͐̎̚̕͘̕͘͘̚̕̚̚͝͠͝͠͝͝͝͝͠͠͝Ņ̸̡̨̨̡̛̛͙̫̟̰̦̥̪͓͔̯͔̟͖̺̖͙̝̹̼̺͈̼̬͚̗͔̩̙̯̮̜̝̣͕̲̤͍̦̙̱̗̯̦̥̼̖͎̹͇̣̣̤͍̺̳͈̠͓̗̻̘̟̱̹͈̘͉̣͕̻͔̼̟̯͙͓͈̳̝̝́̀͗̀̀̽̏̈́̓̑̾͂͋͂̀̊͐͊̑̌͑͑͑̌̏̓̿̅̏̎̏͌̎̍͌̓̔̾͌͊̓̿̉̅̅͆͆̓̇́̾̇͐̀̀͋̚̕͘̕̕̕͘͘͜͠͠ͅͅ ̵̨̤͎͔͉͔̱̌̊̈̂̒̾̕͘R̴̙̻̆̓̏͑̄̾̽͊̉̿̈́͑̀̈́̋̓͌̎̒̈́͝͠Ú̸̡̨̡̡̧̨̢̧̪̰͓͈͔̬̟̻͖͚͔̺̞̦̭̘̮͇͎͓͍͖̪̼̠̮͈̹̗͕͈̘̥͚͈̘͚̦͙͚̰̣̜̮͇̮̞͈͓̹̤͔̙̩̞̦̪̠̩̥̩̱̺͉̳̬̰̘͓̿͐̂̇̉̚͜͜ͅͅṄ̸̨̛̫̣̟͓͇͕̹̦̝̘͉͉̘͖̺͉̜̹͎̦̰͔̪̯̰̗̪̬̣̠̞̰͈̭͚̘̮̗̪̝̣̪͇̥̥͓̘̣͉̘̻̃͊͊̽̌̄̏̄͂͆̃̊̂̾̈́̍̾̽̄̒̀̓̂̀̑̐͐̓̅̇̀͆̅̈́̆͘͘͜͜͜͜͝͝͝ ̸̢̡̡̢̡̧̧̨̧͙̯͎͔̬̬͙̮̣͔̩̥̻̣̰̰̖̜̤̱̝͇̘͎͓͉̮̯̱̜̫̯͇̮̣̯͚̳̜͈͚͖͎̫̟͈͕̹̣̹̰̹̬̘͉̞̩͔̫̘̟̟̹̺̘͈̪̱̣͙͍͈̙͛̐̈̃̄̿͋̈́͗̓̀͗̆̈́̈́̏͆̓̈́͌͗̄̉́̎͐̏͒̓͂͂͑͌͘̚̚̕̚͜͜͝͠Ŗ̷̡̨̛̛̛̼̰̻͙̹͇̬̻̫̭̎̀͂͆̉͂͒̿̏̆͊͊̈́͐̒́̽̅͆̎́́̾̏̀́͋̔̄̔͊͒̏́̌̊́̎̈́̚̚̕͝͝͠Ư̶̢̧̡̨̨̡̨̡̢̧̧̡̬̥̻̺͓̦͍̝̩̻̰͓̰̺̘̰̤̝̲͚̠͉̯̰̫̘̜̼͔̜̦̞̼̖͙̣͎̖̤̺͚̥͙̫͔̞͎͔̻̞̻͇͓͙͔̹͖͈̪͚̬̰̻͍̯̝̖̠͉̬͙̥̼̜͉̦̦̫̦͙̞͔̙̝̝̪͇̟̏̈́̄̈͑͛̀̈̍̃̆͂̈́̾̈́͂̑̑̏͐̊̊̃̿́͌͑͂̐͆̒̋͋̊̓̀͆̆͐͗̎͗̓̏͑͐̈́̂͋̍̌͌͘͘̕͜͠͠͠͠ͅͅͅͅN̵̢̨̧̨̨̛͔̹͓͈̞̙͚͔̖̩̦͇̦̥͎̳̯̯̘͇̥̺̗̱̞̼̞̙̖̘͇̜̗͇̥͓̹͎̻̣̦͈͈̫͕͇̤̭̍̑̒̓͆̇̔̓̀̿̊̍̓͋̏͒̊̒̓̐̓́̆̉̂̓́̈̋́͑̍̓͆̿͊̏͆̎͊̇̓͛̒̇̈͋͐̀̒͗̑̽͐͋͒̓̚͘͘̚̚͘͘͘͘̕͜͜͠͝͠͝͝ͅ ̵̨̧̢̢̢̛̰͉͎͕̳̦̥͚͎̥͔̠̯̹̭͔͇̱͕̬̹̺̰̞͖̯̺̳̤̝̮̺̮̟̭̝̥͕͖̮̯̰̣̫͕͈̮̆̏̂̈́̐̊̃̐̽̓̐͆̒́̑̈̆̿̓̽̿̄͐̑̉̓͊̅̀̈́̔͗͊̉̽͗̇̈̈́̃͗̃̔͛̓̀͒̉͋̃̾̈́̓̇̚͘̚̚̕͝͠͠͝͝͝͝͠͠ͅR̵̛̪̞̥͒Ứ̴̢̧̧̛̛͕̩̟̭͉̟̭̦̮͇̠̬̳̦̤͚͓̪̪͉̱͖͎̠̭͚͓̜͙̣̦͙̠͍̭͍͈̟͖̥͍̈́̂̑̈́̌̏́͐̇͗̇͗̓̿̀̌̓̌̈́̈́̑̇̍̾͐̒̃͑̓̈̑̈́̋̈́͑̃͗̅̏̽̾́̔͒̀̓̊̀̒́̎̍̇͛͑̆̕̚͜͠͝͠͝͝ͅŅ̴̡̨̨̢̣̪̲͎̺̟̹̤͓̠̦̗̦̙͔̲̮̤̜̙̙̼̭͎̦̫̞̬͓̱͎̳̘͖̬̳͙̬̫̠̝̙͖̝̙͍̱̭̯̞͒͛̂̅͆͌̂̇̒̂̇͌̓͌̃͂͒̀̏̉̈̒̕ͅͅ ̸̛̰̟̖̗̼͓̲̹̩̓͛̋̂̇̓̄̀̒̌͛̂̇̂͊̉͐̍͊̈́̏͋̀̏̿̇̔͆̓̍̅́̊̄̒͒͑̌͗͑̐̚̕͘͜͠͠͝Ŗ̴̢̡̛̛͉̳̪͍͙̣͕͍̙̩̝̝̘͔̲̟̭̖̠̝͇͚̫͓͔͎̣̗̦̤̮̟̬̮̣̞̱͓͆̋̉̿̓̊̿̈̽́͆̉̇̑̇̃̃̄̎͑̂͗̈͊̋̏̓͛͒̍̽̇̓̑̓̎̿̓̎͐̓̂̐̉̃̄̓͋̈̀̚̕͜͝͝͠͝ͅͅƯ̸̧̞̣̝͇̬͓͔̻͇̱̰̼̙̫̩̳̓̆̈́̀͊̽́̓̊̒̆̋͐͊̾͐̀́̂́̅͆́̅͛̇͗̓͒̓̂̅͐͂͐̈́̆̈́̉̊̍̆͆̑̋͌͆͊̑̅̑͊͗͛̅̋͌́̏̋̽͑̄̎̀̈́̉̎͛̽͑̆͋̈́̿̐̀͗̅͐͋͗̕̚͘͘͘͘̚̚͜͝͝͝͠͝͝N̷̢̧̛̛̛̻̩̦͕̜͔̙̼̪̪͈̦̥͇̹̬̻̠̱̆̽͊͗̓̈̈́̓̇̅̂̀̌̅̆̄́̽̏̍͆̈́̅̈́̓͒̾̂̐͑̉͛̒̋͂̅͒̑̋̉͆̏̀̿̿̊̒̐́̑̍̊͂̽͒̉̈́̏̓̅̿̓̋͌́͂̕͘̕̚͠͠͠ͅ"
						task.wait(0.05)
						Overlay.Slots.NewSlot.Text = "ḁ̵̡̨̧̢̧̧̢̡̛̛͈̘̼̘̘͖̦̥͖͎̙̘̖̜̼̤͙͙̬̣̭̗̲͖͚̝̰̥̥̘̭̜̝͇̳̭̜̠̙͎̼͖̼̗̮͚͔̩̠̤̠͍̩̦͎͖̲͉̮̮̮͕̖̘̦̻̜̱͓̞͚̱̰̱̻̯͓͇̣̹̞̓͂͂̃̽̒̓͋̌̋̽̆̑͊̆͌̈́̈́̀͂́̃̃̃̎̒̈̋̇͐̋̓͋̌͌͊͑̅̿́̀͒̈̓̊͘͘̕͘͘̚̕͜͝ͅW̴̢̧̨̨̧̛͚̻̞̲̖̠͚̞̼̹͍̠̘̜̣̰̗̲̗̱̺̻͙̯̺̯͕̣̤̱̠̗̜̟̰̬͍̩̮͕͖̬̦̦̥͓̘͈̤͕͍͈̹̦̳̲̯̖̦̥͍͚͖̱̒̊́̄̌̔̍̈̓͐̍́̀̌̀͐̅͛̔̎̅̄̊͑́̎̑̽͋͒͛͗͋͆̔͛̓̐̽̾̐͆̎̎͊̈́̂̀͂̎̀̂͋͒̅̄̏̾́͂̿͆͊͊͒̃̽̊́͐̽̑͗̔͂̃̑̈́̀̂͗͆͒͋̂̆͂̑͂̿̚͘̚̕̕̕̕̚̚͜͜͜͝͝͠͝͝͠ͅͅő̷̡̡̢̩̖̬̪͈̱͎͍̭͔̝͇̝̥̫͇͓͖̬͈̘̝̙͇͇̭̥̼̯̮̫̥͇͇͈̝͓̞̺̥͈̺̖̱͚͇̉̇̾̍͌̉̎̄̇̇͋̄́̆͒͘̕͝͝ͅͅͅḵ̷̢̛̛̛̛̮̝̻̟̠̙̣̜̖̗̼͈͈͎̹̙͔̼̮̭͙̠͚̖͖̳̪̑͂̂͐̃̈͐͆̎̑͆́́̄͊̿̀͛̀̾̑̋͂͑͒̓͊͆̓̒͛̌̅͋̄̍̓͊͗̿̔̇̄̇̿̐̃̊̍̈́̐̂̎̽̑̏̐͊͗̿̀̏̿̌̈͛̔̀͒͗̆͑̽̿̂̐͑͆̉̿̌̈͊͋̓̋̒̾͌͘̕͘̕̚͘̚͝͠͝͝͠͝͝͝͝͠͝͝͠ͅe̷̡̜̘͕̘͚͉̞̹̮̬̮͍̞͍̥͚̬͈͉͌̂̎̀̅̂̿̽̌̆̽̋̈́͐́͐́̔̾̑̈̀͗́̆́̓̐́͛͐̒̃͑̌̊̈́̉̇̇͌̔͛̑̈́̅̌͑̈́̃͌͛̐͐͆̓̿͂͂̔̆͐̀͐̓̈́̅̓̈́̎͗̇̚͘͘̕͘̚̕̚͠͝͝͝͠͠͠͠n̴̡̡̧̧̧̢̧̡̹̦̹̮̫̘̹̳̖̱̰͎̬̟̦͉̖̞͈͙̞͖͖̘̮̦͓͙͖͖̦̞̦̭̺̗̠̖̹̠̩̹͕̞͍̥͉̪̻͖͎̞̖̗̼̼̲̹͕͓͚̬̲̳̜͕̱̥͚̻̝͈̜̩͔͕̼̲̥̮͖͓͚̬̱̬̼̜̝̰̜̞͙̬̲̗͉͕̗͚̅̽͆̾̐̍̑͐̍͊̅̍̌̀͐́̽͋̔̇́̑̑͐̏̌̑̕̚̕͜͜͜͜͜͜͝͝ͅ ̷̧̨̧̧̨̡̨̡̧̡̢̨̨̢̛̪̭̻̙͎͔̖̥̮͔̦͙̜̜̭͍̰̥̬͖͚̺̭̱͚͍̭͔̩̭̫͈̪̩̝͖̦͕͙̥̱͔̝͚͓̮͎̼̘̟͍̞͈̘̣͖͎͉̮̜̬̗̜̲̥͙̭̠̫̦̯͉̫̬͇̻͈̘͕̜̤̲̮͕̣̳̥̳̣́̓̓̈̍̈́̑̐̒͋͆́͛̅̈́́̍͗̐͛͗̊̿̅̄̊̃̏̏́̀͛͂̀̚͜͜͝͝͝͝͝͝ͅd̸̨̡̧̛̛̛̙̬͉̺̤̖̤̳̩̖͖̮͓̜̜͎̪̱̪͕̪͖̻̱̲͚͖͚̗̺͖̻͔͚͖̩̥͚̯̻͔͗̍̽̍̔̎͊͂̅̾̿̓̓̇́̌̓̓̏̈́̌͗̈́̂͐͛̀̓͋̓̍͒̓̔̃̄̇̆̌̀̃̓̈́̊̋͌͛̓͌̀̉̓̑͂̾͊͆͌̈́̔̆̔̿͆̃̑̃̏̾̒͌͑̚̕̕͘̚͜͝͠͝͠͝͠ͅę̷̡̛̛̬̖͚̳̼̟͔̙̦͇͕͕͖͓̤̮͇̹͕̻̯̹͙͍̼͍̭͖͎̗̳̮͍͑̆̉́̈́͗̋̂̉͊͐̒̇̎̍̍͒͛̀̾̂̌̉̄̇̐̂̀̐͋͛̀̆̑͒̇͗̓͑̑̋̔̓͑̌̄̿̊̐͆͌̉͆͋̐̌̇͒̒͌̈͗̏̇̿̒͒̓̎̀͒̑̌̄̄̏̍́͆̿̎̅̽͘͘̚̚͝͠͝͝͠͠͠͝͝M̴̧̛̛̤͉͖͍̟͖̹̜͈̖̼̂̽̄̎̀͛́̈̑̽̊̅͊̍̀̀͂͑̀̇̿̈́̉͐̈́̉̀̔̀͂̉̌͛́̉̌͂̈́̉̎̑̐́́̿̾̃̈́̒̽̄̊̉̚̚̕̚͠͝O̴̡̧̢̨̧̡̢̢̨̧̢͍̻̺̠̖̜̟̹͖͚̩̞͔̪̻̹̮̬̙̣͎͓͈͎͈̬̟̺͓͎͈͉̮̲̮͉̘̦̗͎̱̬͋̔͗̄͗̉̍̌͑͌̑͛̈́͂͒̌̅̍͌̒̈́͗̓̄̏̉̊͋̒̊̏̈́̉́̒̿̾̔͗̍͒̀̚͘̕͘͜͠͝͝ͅn̴̡̧̢̧̨̡̨̨̛̛̛̛͚͖̹̙̺̲̪̬̥̬͎̗̼̻̭̥̻̦͖͕͔̜͖̮̬̰̜͈̮͙̖͖̠̖̩̖͉̻̰̩̟̙̗͔̥̼̼̬̗̬͙̦̩̥͙̻̘̠͕̹̥̞̖̤̘͎̗͕̠̫̬̪̲̘̼͍̩̼͍͍͔̜̳̯̬̟̤̊̆͐̀̍́̽̈̅̒̊̒̐̊̍̄͊̿͆̈́͗̈̊̎̽̅̄̄͋͌̔́̽̆̈́̒̏̾̏̏̔̐̓͐͂̒̈̓́̔̒̔̑̒͐̎̓̏͌̚̕͘͠͝͝͝͝͠͝͝ͅͅͅ"
						Overlay.Slots.NewSlot.Shadow.Text = "ḁ̵̡̨̧̢̧̧̢̡̛̛͈̘̼̘̘͖̦̥͖͎̙̘̖̜̼̤͙͙̬̣̭̗̲͖͚̝̰̥̥̘̭̜̝͇̳̭̜̠̙͎̼͖̼̗̮͚͔̩̠̤̠͍̩̦͎͖̲͉̮̮̮͕̖̘̦̻̜̱͓̞͚̱̰̱̻̯͓͇̣̹̞̓͂͂̃̽̒̓͋̌̋̽̆̑͊̆͌̈́̈́̀͂́̃̃̃̎̒̈̋̇͐̋̓͋̌͌͊͑̅̿́̀͒̈̓̊͘͘̕͘͘̚̕͜͝ͅW̴̢̧̨̨̧̛͚̻̞̲̖̠͚̞̼̹͍̠̘̜̣̰̗̲̗̱̺̻͙̯̺̯͕̣̤̱̠̗̜̟̰̬͍̩̮͕͖̬̦̦̥͓̘͈̤͕͍͈̹̦̳̲̯̖̦̥͍͚͖̱̒̊́̄̌̔̍̈̓͐̍́̀̌̀͐̅͛̔̎̅̄̊͑́̎̑̽͋͒͛͗͋͆̔͛̓̐̽̾̐͆̎̎͊̈́̂̀͂̎̀̂͋͒̅̄̏̾́͂̿͆͊͊͒̃̽̊́͐̽̑͗̔͂̃̑̈́̀̂͗͆͒͋̂̆͂̑͂̿̚͘̚̕̕̕̕̚̚͜͜͜͝͝͠͝͝͠ͅͅő̷̡̡̢̩̖̬̪͈̱͎͍̭͔̝͇̝̥̫͇͓͖̬͈̘̝̙͇͇̭̥̼̯̮̫̥͇͇͈̝͓̞̺̥͈̺̖̱͚͇̉̇̾̍͌̉̎̄̇̇͋̄́̆͒͘̕͝͝ͅͅͅḵ̷̢̛̛̛̛̮̝̻̟̠̙̣̜̖̗̼͈͈͎̹̙͔̼̮̭͙̠͚̖͖̳̪̑͂̂͐̃̈͐͆̎̑͆́́̄͊̿̀͛̀̾̑̋͂͑͒̓͊͆̓̒͛̌̅͋̄̍̓͊͗̿̔̇̄̇̿̐̃̊̍̈́̐̂̎̽̑̏̐͊͗̿̀̏̿̌̈͛̔̀͒͗̆͑̽̿̂̐͑͆̉̿̌̈͊͋̓̋̒̾͌͘̕͘̕̚͘̚͝͠͝͝͠͝͝͝͝͠͝͝͠ͅe̷̡̜̘͕̘͚͉̞̹̮̬̮͍̞͍̥͚̬͈͉͌̂̎̀̅̂̿̽̌̆̽̋̈́͐́͐́̔̾̑̈̀͗́̆́̓̐́͛͐̒̃͑̌̊̈́̉̇̇͌̔͛̑̈́̅̌͑̈́̃͌͛̐͐͆̓̿͂͂̔̆͐̀͐̓̈́̅̓̈́̎͗̇̚͘͘̕͘̚̕̚͠͝͝͝͠͠͠͠n̴̡̡̧̧̧̢̧̡̹̦̹̮̫̘̹̳̖̱̰͎̬̟̦͉̖̞͈͙̞͖͖̘̮̦͓͙͖͖̦̞̦̭̺̗̠̖̹̠̩̹͕̞͍̥͉̪̻͖͎̞̖̗̼̼̲̹͕͓͚̬̲̳̜͕̱̥͚̻̝͈̜̩͔͕̼̲̥̮͖͓͚̬̱̬̼̜̝̰̜̞͙̬̲̗͉͕̗͚̅̽͆̾̐̍̑͐̍͊̅̍̌̀͐́̽͋̔̇́̑̑͐̏̌̑̕̚̕͜͜͜͜͜͜͝͝ͅ ̷̧̨̧̧̨̡̨̡̧̡̢̨̨̢̛̪̭̻̙͎͔̖̥̮͔̦͙̜̜̭͍̰̥̬͖͚̺̭̱͚͍̭͔̩̭̫͈̪̩̝͖̦͕͙̥̱͔̝͚͓̮͎̼̘̟͍̞͈̘̣͖͎͉̮̜̬̗̜̲̥͙̭̠̫̦̯͉̫̬͇̻͈̘͕̜̤̲̮͕̣̳̥̳̣́̓̓̈̍̈́̑̐̒͋͆́͛̅̈́́̍͗̐͛͗̊̿̅̄̊̃̏̏́̀͛͂̀̚͜͜͝͝͝͝͝͝ͅd̸̨̡̧̛̛̛̙̬͉̺̤̖̤̳̩̖͖̮͓̜̜͎̪̱̪͕̪͖̻̱̲͚͖͚̗̺͖̻͔͚͖̩̥͚̯̻͔͗̍̽̍̔̎͊͂̅̾̿̓̓̇́̌̓̓̏̈́̌͗̈́̂͐͛̀̓͋̓̍͒̓̔̃̄̇̆̌̀̃̓̈́̊̋͌͛̓͌̀̉̓̑͂̾͊͆͌̈́̔̆̔̿͆̃̑̃̏̾̒͌͑̚̕̕͘̚͜͝͠͝͠͝͠ͅę̷̡̛̛̬̖͚̳̼̟͔̙̦͇͕͕͖͓̤̮͇̹͕̻̯̹͙͍̼͍̭͖͎̗̳̮͍͑̆̉́̈́͗̋̂̉͊͐̒̇̎̍̍͒͛̀̾̂̌̉̄̇̐̂̀̐͋͛̀̆̑͒̇͗̓͑̑̋̔̓͑̌̄̿̊̐͆͌̉͆͋̐̌̇͒̒͌̈͗̏̇̿̒͒̓̎̀͒̑̌̄̄̏̍́͆̿̎̅̽͘͘̚̚͝͠͝͝͠͠͠͝͝M̴̧̛̛̤͉͖͍̟͖̹̜͈̖̼̂̽̄̎̀͛́̈̑̽̊̅͊̍̀̀͂͑̀̇̿̈́̉͐̈́̉̀̔̀͂̉̌͛́̉̌͂̈́̉̎̑̐́́̿̾̃̈́̒̽̄̊̉̚̚̕̚͠͝O̴̡̧̢̨̧̡̢̢̨̧̢͍̻̺̠̖̜̟̹͖͚̩̞͔̪̻̹̮̬̙̣͎͓͈͎͈̬̟̺͓͎͈͉̮̲̮͉̘̦̗͎̱̬͋̔͗̄͗̉̍̌͑͌̑͛̈́͂͒̌̅̍͌̒̈́͗̓̄̏̉̊͋̒̊̏̈́̉́̒̿̾̔͗̍͒̀̚͘̕͘͜͠͝͝ͅn̴̡̧̢̧̨̡̨̨̛̛̛̛͚͖̹̙̺̲̪̬̥̬͎̗̼̻̭̥̻̦͖͕͔̜͖̮̬̰̜͈̮͙̖͖̠̖̩̖͉̻̰̩̟̙̗͔̥̼̼̬̗̬͙̦̩̥͙̻̘̠͕̹̥̞̖̤̘͎̗͕̠̫̬̪̲̘̼͍̩̼͍͍͔̜̳̯̬̟̤̊̆͐̀̍́̽̈̅̒̊̒̐̊̍̄͊̿͆̈́͗̈̊̎̽̅̄̄͋͌̔́̽̆̈́̒̏̾̏̏̔̐̓͐͂̒̈̓́̔̒̔̑̒͐̎̓̏͌̚̕͘͠͝͝͝͝͠͝͝ͅͅͅ"
						task.wait(0.05)
					end
				end
			end)
			if Overlay:FindFirstChild("ServerFrame") then
				local alreadyScared = false
				for i, child in ipairs(Overlay.Slots:GetChildren()) do
					if child:IsA("TextButton") and child:FindFirstChild("CharacterName") then
						child.MouseButton1Click:Connect(function()
							if not alreadyScared then
								local scaryPrompt = math.random(1, 12)
								if scaryPrompt == 1 then
									alreadyScared = true
									local isScaring = true
									Tween(Overlay.Vignette,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.1, {
										ImageColor3 = Color3.fromRGB(0, 0, 0)
									})
									Overlay.ServerFrame.Visible = false
									for _, music in ipairs(loadingScript.Music:GetChildren()) do
										if music.Playing then
											music.Playing = false
											music.PlaybackSpeed = 0.098
											CollectionService:AddTag(music,"MusicOff")
										end
									end
									spawn(function()
										while true do
											if not isScaring then
												Overlay.ServerFrame.Visible = true
												Overlay.Title.Visible = false
												break
											end
											Overlay.ServerFrame.Visible = false
											Overlay.Title.Visible = true
											task.wait(0.1)
										end
									end)
									Overlay.Title.Visible = true
									local scaryText = Instance.new("TextLabel")
									scaryText.Name = "ScaryText"
									scaryText.AnchorPoint = Vector2.new(0.5, 0)
									scaryText.BackgroundTransparency = 1
									scaryText.BorderSizePixel = 0
									scaryText.Position = UDim2.new(0.5, 0, 0, 25)
									scaryText.ZIndex = 5
									scaryText.Size = UDim2.new(0, 500, 0, 250)
									scaryText.Font = Enum.Font.Bodoni
									scaryText.TextSize = 100
									scaryText.Text = "DON'T LEAVE"
									scaryText.TextColor3 = Color3.fromRGB(255, 255, 255)
									scaryText.Parent = Overlay.Title
									local scaryVoice = Instance.new("Sound")
									scaryVoice.Name = "ScaryVoice"
									scaryVoice.Parent = Overlay
									scaryVoice.SoundId = getcustomasset("CreepWoken/dontleave.mp3", false)
									scaryVoice.Looped = false
									scaryVoice.TimePosition = 0.2
									scaryVoice.Volume = 3.8
									scaryVoice:Play()
									typeText(scaryText,nil,"DON'T ",0.18)
									task.wait(0.3)
									typeText(scaryText,"DON'T ","LEAVE",0.18)
									task.wait(0.8)
									Tween(scaryText,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 1, {
										TextTransparency = 1
									})
									task.wait(1)
									Overlay.Title.Visible = false
									scaryText:Destroy()
									scaryVoice:Destroy()
									spawn(function()
										for _, music in ipairs(loadingScript.Music:GetChildren()) do
											spawn(function()
												if music.Playing == false and CollectionService:HasTag(music,"MusicOff") then
													CollectionService:RemoveTag(music,"MusicOff")
													music.Playing = true
													Tween(music,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.45, {
														PlaybackSpeed = 0.65
													})
												end
											end)
										end
									end)
									task.wait(0.2)
									isScaring = false
									Tween(Overlay.Vignette,Enum.EasingDirection.InOut, Enum.EasingStyle.Sine, 0.25, {
										ImageColor3 = Color3.fromRGB(45, 45, 45)
									})
								end
							end
						end)
					end
				end
			end
		end
	end

	if Overlay.ContinuePrompt.Visible == false and Overlay.Slots:FindFirstChild("A") then
		beginCreepWoken()
	else
		local connection
		connection = Overlay.ContinuePrompt:GetPropertyChangedSignal("Visible"):Connect(function()
			if Overlay.ContinuePrompt.Visible == false then
				connection:Disconnect()
				beginCreepWoken()
			end
		end)
	end

	warn("w̷̧̡̧̧̛̛̛̮͈̹͔̘͚͓̯̖̟̼̹͍̫̹̩̪̤̬͚̭̗̖̬̫̬͈̖͎̫̪̤͇̝͙̱̖̻̤͈͇̪̝͍̬̠̱͉̺̳̺̺͇͉̗̯̎̾̅͗̓͒͊̇̎̌̌́͋̒̎̎̾̂̈́̉̐̈́́͑̈́̌̐̌͛͒̎̂̊̐̂̃́̎̆̍̑̉̚̚̕͜͜͜͝͝͠͝e̷̡̧̛̙̰͚͍̣̣̥̭͔͚̱̮̬͓̟͈̮̼͔̮̥̤̮̮̰̝̳̘͈̞̖̩͔͎̩̱̦͍͚̓̉͋̾̆̑̌̉͑̆̉̌͒̊̽̽̄́̿̌̿͘ ̸̨̛̛͓̗̟̞̔̅̆̃͐͊̄̍͑̏̾̍̀͌͒̓̉͋̓̈͗͆̎͂̈́̈́̽̑̐̆͊̋̇̎̐̐̀̈͛̈́͌̒̿̃̒̕̕̚͝͝͝͝͠͝A̴̢̢̲̳̺̻̜̣͚̳̺̩̱̥̲̟̜͛̉̏̍̒̓͌́̏̆̿̃͋̾͗͑̔̈̊̕͝͝͠r̷̨̨̢̨̨̧̢̛̻̝̰̼̫̬̭͕̝͓̤̪͙̪̗̼̼̜̞̻͉͓̬͓̩̙̞̖̖̪̣͖͓̭̺̫̽̂͌̍͛́̃̅̑͊̀̀̎̃̊̾̀̚͜͠ͅȩ̸̡̢̧̡̧̼̖̞̮͍͓͙̪͓͉͖̮̙̙̟̳͙͍͍̲̱̬̰̜̥̙̻̫̜̗̯̼̖͚͕̜̝̳͈̮͍̱͖̰̬̟̱̊͊̋͐̉͒̿̊͛̏̌̏̌̒͋̈́̄̎͐́̐̀̉̈͒̀͊̈́̀̓̿̓̏̓̆̌̚͘̕̚͘͜ͅͅ ̷̨̙̙̯̈́͋̍̃̆̋̽͛͒̓̇̈́̔̒̋̇̒̃̓͑̚̚͝͠w̸̛̛̛̦̮̦̮̥̮̣͎̳̤̹͑̋̃̂͆̎̂̄̅̈̍̍̊̅̈̍̈́̂̄̐͆͂́̀̃̎̆͘̚̚͝͠͠͝͠͠ą̶̢̢̢͚͇̥͔̫͕̹̻̳̜̬̲̘̝̜̣̻̼͈͈̺̫̻͉̭̺͇̝͚͚͈̳̦̻̩̙̞̦͂̒̉͌͐͂̎̈͒̀͌T̶̢̧̛͔͎̼̻̳̹̞̬͚̘͕̣͎̬̠͍̣̲͎͙̖̗͕̬̼̝̲̭̠͕̗͙̰̬͚̞͎̓͆̓͊̀̑͐̾̃̒̏̇́̈͛̍̅̄̈́̍̇̈́͑̒͛́̾̑̾͘͘͘̕͘͜͝͝͝ͅç̴̡̨̛̛̮̳̲̰̮̻͔͎̙̓̈̾̽͂́̎́̀͆̅̑͑̇̎͌͋͗̅̔̅̀̈́̔̽̐͂̕̕̚͠ḥ̵̨͈̿͛̉̽̀̑̾̽̉͜Í̸̘͖͕̝͙͖̦̰͔̄͛͒̎͌̾̒̅n̵̛͍͇̆̄̐́̾̒̐́̈́̒̓̂͆̉̈́͋̇̒̌̆̀̈́̈́́̆͊̆̅̈̈́͆̊͊̓̑̄̾̈́̌̈́̇͌̌̊͆̌͋̈́͑̀̃̈́͘̚͘̚̚͠ģ̷̢̡̧̖͓̰͙̗̬̫̮̤̣̗͈̼̞̲̝̘̻͈͍̦̻͖͓̼̮͕͎̮͔͖͔̘̬̖̥̠̀̔́̓̎̓̄͒̈́͋̎̀̎͐͌͂̒̾͗͒̈́̂̆͋̍̍́͌̈́͒̄̀͊̾̉͐̂̿̀̀͆̈́͗͋̌̋̈́̕͝͠͝͝ͅ ̵̨̨̢̧̨̛̛̛͖̺̜̝͖̦͙̞̱̭̻̤̟̫̻̰̩̩̼̻͕̼͎̭͇̬̝̰͔̝̞͇̥̲̙͕̘̮̲͕͎͎̣̥̻̪̻̭͑̾̓̎̾̒̏̂̈͐͋̑͘͜͜ͅy̸̢̢̡͚̜̳̦̖͓̠̞͇̣͈͇̞̺̦̣̘̬̲͚͚̙̥̻̗͖͍̗̝̮̤̩̮̦̜̲͈̝̫͙̞͋͌̊̍̆̒̆̍̋̎̄̌͐̔͊̎͒͌̐́͗̂̐̾͒̐͆̀̕͜͜ͅO̸̧̧̨̡̨̧̨̧̡̯͈̘̟͇̥͍̰̭̜͕̩̘̺͖͙̖̝͍͍͍̯̝̮̟̗̬͚̟͕̖̞̯͉̼̟̬̙̝͉͚̻͔̲̣̖͙̓͑͂̈͌͒̓͌̏̌̆͛̍̒̈̈́̍̊̓̈́̓̆͒̈́͗̇̽̚͘͜͜ͅͅu̶̡̡̢̯̼̞͕̭̝͇̺͓͓͉͚͍̙͔͎̟̥͈̯̞͈̥̥̝̹̪̠͖̣͚̜̮̤̞̲̤͆͛̏̒͗͑̃̆̑̂̐̈́́̒̿̾͌̽̀̈́̂̊̎̈̏̆̀̐̓̎̿̈́̊̃͊͗̈́̅̌͑̋̔͘͘̚͘̚̕͜͜͜͠͝ͅͅ")
else
	return
end
